In [1]:
import pandas as pd
import numpy as np

In [14]:
df1 = pd.DataFrame(np.arange(5), columns=['number'])

In [15]:
df1

   number
0       0
1       1
2       2
3       3
4       4

In [16]:
df2 = pd.DataFrame(np.arange(5, 10), columns=['number'])

In [17]:
df2

   number
0       5
1       6
2       7
3       8
4       9

## 산술연산

In [22]:
df1+df2

   number
0       5
1       7
2       9
3      11
4      13

In [30]:
df1.add(df2)

   number
0       5
1       7
2       9
3      11
4      13

In [23]:
df1-df2

   number
0      -5
1      -5
2      -5
3      -5
4      -5

In [24]:
df1*df2

   number
0       0
1       6
2      14
3      24
4      36

In [25]:
df1/df2

     number
0  0.000000
1  0.166667
2  0.285714
3  0.375000
4  0.444444

In [28]:
df1%df2

   number
0       0
1       1
2       2
3       3
4       4

In [40]:
df.head()

   number
0       0
1       1
2       2
3       3
4       4

## 통계

### 1. 합계

In [34]:
df.sum(axis=0)

number    10
dtype: int64

In [32]:
df.sum(axis=1)

0    0
1    1
2    2
3    3
4    4
dtype: int64

### 2. 평균

In [36]:
df.mean(axis=0, skipna=False)

number    2.0
dtype: float64

In [37]:
df.mean(axis=1, skipna=False)

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

### 3. 누적합계

In [38]:
df.cumsum()

   number
0       0
1       1
2       3
3       6
4      10

### 4. 최소값, 최대값이 있는 index 반환

In [61]:
sample = np.random.rand(10)

In [62]:
sample

array([0.65397913, 0.84245463, 0.65191629, 0.37250872, 0.63571204,
       0.8395764 , 0.72915107, 0.68503749, 0.44174267, 0.03599749])

In [66]:
sample = sample.reshape(5, 2)

In [68]:
sample

array([[0.65397913, 0.84245463],
       [0.65191629, 0.37250872],
       [0.63571204, 0.8395764 ],
       [0.72915107, 0.68503749],
       [0.44174267, 0.03599749]])

In [69]:
df1 = pd.DataFrame(sample, columns=['number1', 'number2'])

In [70]:
df1

    number1   number2
0  0.653979  0.842455
1  0.651916  0.372509
2  0.635712  0.839576
3  0.729151  0.685037
4  0.441743  0.035997

In [71]:
df1.idxmin()

number1    4
number2    4
dtype: int64

In [72]:
df1.idxmax()

number1    3
number2    0
dtype: int64

### 5. 중간값

In [79]:
df1.median()

number1    0.651916
number2    0.685037
dtype: float64

### 6. 평균값에서 절대 평균편차를 구함

**평균 절대 편차**(average absolute deviation 또는 mean absolute deviation, AAD, MAD) 또는 **평균 편차(mean deviation)** 또는 **절대 편차**(absolute deviation)는 산포도의 하나로, **평균과 개별 관측치 사이 거리의 평균**이다. 각 측정치에서 전체 평균을 뺀 절댓값으로 표시되는 편차의 산술평균을 말한다. 매우 크거나 작은 어느 하나의 값인 이상치로 인한 문제점을 보완할 수 있는 방법으로 사용되고 있다. 평균편차에는 모집단 평균편차와 표본 평균편차 두 가지 종류가 있다.

평균 대신 중앙값을 쓸 경우 중앙값 절대 편차이다.

In [80]:
df1.mad()

number1    0.072303
number2    0.280689
dtype: float64

### 7. 분산

통계학에서 분산(variance) 또는 변량은 관측값에서 평균을 뺀 값을 제곱하고, 그것을 모두 더한 후 전체 갯수로 나눠서 구한다. 

즉, 차이값의 제곱의 평균이다. 관측값에서 평균을 뺀 값인 편차를 모두 더하면 0이 나오므로 제곱해서 더한다.

나무위키 - [분산](https://namu.wiki/w/%EB%B6%84%EC%82%B0) 참고.

In [82]:
df1.var()

number1    0.011520
number2    0.120798
dtype: float64

### 8. 표준편차

**표준편차**는 해당 집단 내 각 표본의 측정값이 평균에서 어느 정도 떨어져 있는지를 나타내는 지표입니다.

표준 편차(standard deviation)는 분산을 제곱근한 것이다. 제곱해서 값이 뻥튀기 된 분산을 제곱근해서 다시 원래 크기로 만들어준다

나무위키 - [표준편차](https://namu.wiki/w/%ED%91%9C%EC%A4%80%20%ED%8E%B8%EC%B0%A8) 참고.

In [83]:
df1.std()

number1    0.107329
number2    0.347559
dtype: float64

### 9. 표본 비대칭도

In [84]:
df1.skew()

number1   -1.561632
number2   -0.963129
dtype: float64

### 10. 표본 첨도 (4차 적률)

In [85]:
df1.kurt()

number1    3.291145
number2   -0.514548
dtype: float64

### 11. 퍼센트 변화량

In [86]:
df1.pct_change()

    number1   number2
0       NaN       NaN
1 -0.003154 -0.557829
2 -0.024856  1.253844
3  0.146983 -0.184068
4 -0.394169 -0.947452

## 정보 출력

In [47]:
df.count()

number    5
dtype: int64

In [48]:
df.describe()

         number
count  5.000000
mean   2.000000
std    1.581139
min    0.000000
25%    1.000000
50%    2.000000
75%    3.000000
max    4.000000